bench/500r-10c.txt
Server Software:        nginx/1.27.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /tmp/static/index.html
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   0.082 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    500
Total transferred:      284500 bytes
HTML transferred:       165500 bytes
Requests per second:    6065.02 [#/sec] (mean)
Time per request:       1.649 [ms] (mean)
Time per request:       0.165 [ms] (mean, across all concurrent requests)
Transfer rate:          3370.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     1    2   0.8      1       7
Waiting:        0    1   0.8      1       6
Total:          1    2   0.9      1       7
WARNING: The median and mean for the processing time are not within a normal deviation
        These results are probably not that reliable.
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      3
  95%      3
  98%      4
  99%      5
 100%      7 (longest request)